phuminsingla/lambda-library-Mac/packages/lambda/hardware/avr/0.0.2/boards.txt
menu.cpu=Processor

lambda.name=LAMBDA (Lite/Basic/Plus)

lambda.vid.0=0x2341
lambda.pid.0=0x0043
lambda.vid.1=0x2341
lambda.pid.1=0x0001
lambda.vid.2=0x2A03
lambda.pid.2=0x0043
lambda.vid.3=0x2341
lambda.pid.3=0x0243

lambda.upload.tool=avrdude_new
lambda.upload.protocol=arduino
lambda.upload.maximum_size=32256
lambda.upload.maximum_data_size=2048
lambda.upload.speed=115200

lambda.bootloader.tool=avrdude_new
lambda.bootloader.low_fuses=0xFF
lambda.bootloader.high_fuses=0xDE
lambda.bootloader.extended_fuses=0x05
lambda.bootloader.unlock_bits=0x3F
lambda.bootloader.lock_bits=0x0F
lambda.bootloader.file=optiboot/optiboot_atmega328.hex

lambda.build.mcu=atmega328pb
lambda.build.f_cpu=16000000L
lambda.build.board=AVR_UNO
lambda.build.core=arduino:arduino
lambda.build.variant=lambda
